{
  "beta_root": "/mnt/TeamShare/Data_Masterfile/H20-00572_All-Dressed/Zahra-Thesis-Data/fmri_opt_group/results_beta_preprocessed",
  "bold_thr90_html_reference": "/home/zkavian/Master_thesis_final/data/voxel_weights_task1_bold0.6_beta0.6_smooth1.25_gamma1.5_bold_thr90.html",
  "gvs_order": "/home/zkavian/Master_thesis_final/data/gvs_order_by_subject_session_run.tsv",
  "n_rois": 38,
  "n_selected_roi_voxels": 8503,
  "network_definition": "finite nonzero NIfTI weights >= p90 threshold; ROI values are weighted means over selected voxels only",
  "per_trial_roi_betas_source": "cleaned beta volumes summarized within selected p90 optimization-weight voxels",
  "roi_percentile": 90.0,
  "weight_map": "/home/zkavian/Master_thesis_final/data/voxel_weights_task1_bold0.6_beta0.6_smooth1.25_gamma1.5.nii.gz",
  "weight_threshold": 0.00035733996281983593
}
