{
  "selected_source": "/home/zkavian/Master_thesis_final/data/voxel_weights_task1_bold0.6_beta0.6_smooth1.25_gamma1.5.nii.gz",
  "selected_source_type": "nifti_weight_percentile",
  "selected_definition": "weights >= p90 over finite nonzero weights",
  "selected_threshold_percentile": 90.0,
  "selected_threshold_value": 0.00035733997356146574,
  "selected_nonzero_weight_count": 91862,
  "motor_mask_source": "harvard_oxford_thr25_plus_fsl_cerebellum_mnifnirt_thr25",
  "motor_label_patterns": [
    "precentral gyrus",
    "juxtapositional lobule cortex",
    "supplementary motor",
    "precentral",
    "postcentral gyrus",
    "frontal medial cortex",
    "paracentral lobule",
    "thalamus",
    "caudate nucleus",
    "putamen",
    "globus pallidus",
    "pallidum",
    "cerebellum"
  ],
  "motor_region_names": [
    "Cortical: Precentral Gyrus",
    "Cortical: Postcentral Gyrus",
    "Cortical: Frontal Medial Cortex",
    "Cortical: Juxtapositional Lobule Cortex (formerly Supplementary Motor Cortex)",
    "Subcortical: Left Thalamus",
    "Subcortical: Left Putamen",
    "Subcortical: Left Pallidum",
    "Subcortical: Right Thalamus",
    "Subcortical: Right Putamen",
    "Subcortical: Right Pallidum",
    "Cerebellum (FSL maxprob)"
  ],
  "motor_region_counts": [
    8573,
    6895,
    976,
    1484,
    1321,
    799,
    267,
    1283,
    796,
    260,
    21522
  ],
  "cerebellum_atlas": "/usr/local/fsl/data/atlases/Cerebellum/Cerebellum-MNIfnirt-maxprob-thr25-2mm.nii.gz",
  "weight_map": "/home/zkavian/Master_thesis_final/data/voxel_weights_task1_bold0.6_beta0.6_smooth1.25_gamma1.5.nii.gz",
  "beta_root": "/mnt/TeamShare/Data_Masterfile/H20-00572_All-Dressed/Zahra-Thesis-Data/fmri_opt_group/results_beta_preprocessed",
  "group_concat_dir": "/mnt/TeamShare/Data_Masterfile/H20-00572_All-Dressed/Zahra-Thesis-Data/fmri_opt_group/data/group_concat",
  "beta_path": "/mnt/TeamShare/Data_Masterfile/H20-00572_All-Dressed/Zahra-Thesis-Data/fmri_opt_group/data/group_concat/cleaned_beta_volume_group.npy",
  "active_flat_path": "/mnt/TeamShare/Data_Masterfile/H20-00572_All-Dressed/Zahra-Thesis-Data/fmri_opt_group/data/group_concat/active_flat_indices__group.npy",
  "manifest_path": "/mnt/TeamShare/Data_Masterfile/H20-00572_All-Dressed/Zahra-Thesis-Data/fmri_opt_group/data/group_concat/concat_manifest_group.tsv",
  "metric": "mean_abs_consecutive_trial_diff_divided_by_abs_voxel_mean",
  "aggregation_mode": "subject_session_voxelwise_nanmean",
  "pre_normalize_each_manifest_segment": true,
  "pre_normalization_mode": "demean_then_divide_by_maxabs_per_manifest_file_over_target_voxels_and_kept_trials",
  "min_abs_voxel_mean": 1e-12,
  "manifest_segment_count": 58,
  "metric_unit_count_total": 29,
  "metric_unit_labels": [
    "sub-pd004_ses-1",
    "sub-pd004_ses-2",
    "sub-pd007_ses-1",
    "sub-pd007_ses-2",
    "sub-pd009_ses-1",
    "sub-pd009_ses-2",
    "sub-pd010_ses-1",
    "sub-pd010_ses-2",
    "sub-pd011_ses-1",
    "sub-pd011_ses-2",
    "sub-pd012_ses-1",
    "sub-pd012_ses-2",
    "sub-pd013_ses-1",
    "sub-pd013_ses-2",
    "sub-pd014_ses-1",
    "sub-pd014_ses-2",
    "sub-pd015_ses-1",
    "sub-pd015_ses-2",
    "sub-pd017_ses-2",
    "sub-pd018_ses-1",
    "sub-pd018_ses-2",
    "sub-pd020_ses-1",
    "sub-pd020_ses-2",
    "sub-pd023_ses-1",
    "sub-pd023_ses-2",
    "sub-pd024_ses-1",
    "sub-pd024_ses-2",
    "sub-pd028_ses-1",
    "sub-pd028_ses-2"
  ],
  "motor_pool_size": 44176,
  "selected_in_motor_count": 1823,
  "selected_count_total": 9189,
  "nonselected_count_total": 42353,
  "selected_count_norm_diff_valid": 9050,
  "nonselected_count_norm_diff_valid": 22544,
  "selected_mean_norm_diff": 2.498459900921139,
  "nonselected_mean_norm_diff": 3.4654532320765687,
  "selected_median_norm_diff": 1.4204433907383627,
  "nonselected_median_norm_diff": 1.4970950004983337,
  "selected_min_units_per_voxel_norm_diff": 22,
  "nonselected_min_units_per_voxel_norm_diff": 22,
  "selected_max_units_per_voxel_norm_diff": 29,
  "nonselected_max_units_per_voxel_norm_diff": 29,
  "norm_diff_resample_mean": 3.457822128656518,
  "norm_diff_resample_std": 0.5249538234039236,
  "norm_diff_resample_ci_2p5": 2.7639241796381793,
  "norm_diff_resample_ci_97p5": 4.379648954416848,
  "norm_diff_resample_p_lower_or_equal_selected": 0.000999000999000999,
  "norm_diff_resample_with_replacement": false,
  "num_resamples": 1000,
  "random_seed": 13,
  "batch_size": 2048,
  "analysis_npz_path": "/home/zkavian/Master_thesis_final/figures/prove_hypothesis/trial_variability_hypothesis_analysis_data.npz",
  "norm_diff_cd_main_png_path": "/home/zkavian/Master_thesis_final/figures/prove_hypothesis/trial_variability_hypothesis_norm_diff_cd(main).png",
  "norm_diff_cd_main_pdf_path": "/home/zkavian/Master_thesis_final/figures/prove_hypothesis/trial_variability_hypothesis_norm_diff_cd(main).pdf"
}